{"ast":null,"code":"import _extends from \"@babel/runtime/helpers/esm/extends\";\nimport _objectWithoutProperties from \"@babel/runtime/helpers/esm/objectWithoutProperties\";\nvar __jsx = React.createElement;\nimport React from 'react';\nimport { mdx } from '@mdx-js/react';\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\n\nimport BlogPost from '../../components/BlogPost';\nexport var meta = {\n  published: true,\n  publishedAt: '2019-06-15',\n  title: 'This is my second post',\n  summary: 'I am learning how to build a blog using Markdown in a static web page build on top of Next.js'\n};\nvar layoutProps = {\n  meta: meta\n};\n\nvar MDXLayout = function MDXLayout(_ref) {\n  var children = _ref.children;\n  return mdx(BlogPost, {\n    meta: meta\n  }, children);\n};\n\nexport default function MDXContent(_ref2) {\n  var components = _ref2.components,\n      props = _objectWithoutProperties(_ref2, [\"components\"]);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"Nam pellentesque metus mi, vel laoreet erat ullamcorper nec. Integer lacinia efficitur tellus at lobortis. Fusce eu felis non neque tincidunt egestas ac eget diam. Donec dolor nibh, rhoncus quis tempor non, hendrerit vitae nisi. Quisque cursus odio sit amet dignissim gravida. Cras pulvinar nulla risus, in consectetur urna varius sit amet. Fusce lacus nisl, efficitur eget libero bibendum, malesuada porttitor arcu. Suspendisse scelerisque a risus ut ullamcorper. Etiam et mi ut diam viverra consectetur. Nam vestibulum diam sed vehicula tempus.\"), mdx(\"h3\", null, \"Ut vel tincidunt nulla\"), mdx(\"p\", null, \"Duis urna velit, auctor vitae dolor fringilla, hendrerit volutpat mi. Quisque convallis nisl quis leo fringilla, at blandit mauris facilisis. Suspendisse et consequat ipsum. Nullam et tellus ut orci lacinia feugiat quis non felis. Vestibulum sit amet tellus rutrum, varius velit vel, elementum ipsum. Mauris molestie odio nec lectus volutpat, eu sodales magna sagittis. Morbi tristique, quam eu interdum mattis, sapien ligula iaculis ex, at pharetra nulla nunc quis neque.\"), mdx(\"p\", null, \"Duis elementum orci id lorem suscipit, at rhoncus eros commodo. Duis a maximus felis, quis venenatis elit. Praesent pulvinar, nibh ac rhoncus condimentum, magna metus aliquam leo, quis maximus felis ex vel nibh. Aliquam facilisis neque eu orci suscipit dictum. Nulla eget nulla auctor, vestibulum ex dictum, molestie mauris. Nulla aliquet auctor pretium. Cras volutpat tellus vitae ipsum interdum cursus. Aenean urna felis, accumsan in dignissim ac, facilisis sed nulla. Proin id vestibulum odio, quis sagittis tellus. Morbi vulputate ligula et turpis elementum ultricies. Suspendisse potenti. Morbi sollicitudin aliquam nulla, sed sodales enim dapibus quis. Suspendisse molestie sollicitudin risus eu pulvinar. Quisque commodo mauris sit amet urna rhoncus congue.\"));\n}\n;\nMDXContent.isMDXComponent = true;","map":null,"metadata":{},"sourceType":"module"}