{"ast":null,"code":"var __jsx = React.createElement;\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nimport React from 'react';\nimport { mdx } from '@mdx-js/react';\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\n\nimport BlogPost from '../../components/BlogPost';\nexport const meta = {\n  published: true,\n  publishedAt: '2020-01-15',\n  title: 'This is my third post',\n  summary: 'I am learning how to build a blog using Markdown in a static web page build on top of Next.js'\n};\nconst layoutProps = {\n  meta\n};\n\nconst MDXLayout = ({\n  children\n}) => mdx(BlogPost, {\n  meta: meta\n}, children);\n\nexport default function MDXContent(_ref) {\n  let {\n    components\n  } = _ref,\n      props = _objectWithoutProperties(_ref, [\"components\"]);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, `Aenean vitae quam consequat, tempus tortor sit amet, volutpat magna. Fusce aliquam ex sit amet nibh finibus dapibus. Proin a erat id elit vestibulum euismod. Morbi fermentum varius ex quis volutpat. Cras interdum, risus ut laoreet vulputate, ante mi porttitor erat, nec rhoncus massa odio ut ante. Morbi sit amet tristique enim, quis porta orci. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Nulla vel ex iaculis, interdum risus sit amet, pellentesque mi. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Suspendisse eu dui vel velit bibendum ultrices vel in nisi. Mauris ac ultricies risus.`), mdx(\"h3\", null, `Sed finibus`), mdx(\"p\", null, `Libero vel aliquam condimentum, nisl odio imperdiet quam, non finibus urna massa eget dui. In at auctor ex. Fusce aliquet tellus sit amet ultricies pellentesque. Suspendisse velit purus, aliquet eu aliquet a, egestas ac enim. In auctor accumsan dolor eget porttitor. Fusce vestibulum velit eget dui pretium, eu faucibus arcu sodales. Fusce sed sapien facilisis, tristique nulla vitae, finibus elit. Phasellus pretium, odio non volutpat mollis, risus odio semper turpis, ac malesuada odio risus eu nunc. Curabitur nec urna et nulla condimentum tempus quis sagittis sem. Vestibulum vel malesuada mauris, in vehicula leo.`), mdx(\"p\", null, `In at urna metus. Nam dapibus sollicitudin tincidunt. Praesent vel ante nec neque accumsan dictum at at velit. Ut placerat leo ac orci dictum pellentesque. Quisque aliquet aliquet lobortis. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Donec sed condimentum ante. Vivamus a metus nisl. Interdum et malesuada fames ac ante ipsum primis in faucibus. Proin vitae diam ac mi pellentesque tempor nec quis orci. Cras fringilla, tellus a tempor aliquam, neque lacus lobortis nulla, ac imperdiet dui dui a odio. Vivamus ultrices pellentesque venenatis. Aliquam nec vehicula felis, eget scelerisque metus. Ut maximus aliquam hendrerit. In viverra nunc ac mauris tempus, ac ultrices lectus bibendum. Cras et neque justo.`));\n}\n;\nMDXContent.isMDXComponent = true;","map":null,"metadata":{},"sourceType":"module"}